FemDesign.Results.ShellInternalForce
FemDesign "Bars, End forces" result

FemDesign.Results.ShellInternalForce.Id
Bar name identifier

FemDesign.Results.ShellInternalForce.ElementId
Finite element element id

FemDesign.Results.ShellInternalForce.NodeId
Finite element node id

FemDesign.Results.ShellInternalForce.Mx
Mx'

FemDesign.Results.ShellInternalForce.My
My'

FemDesign.Results.ShellInternalForce.Mxy
Mx'y'

FemDesign.Results.ShellInternalForce.Nx
Nx'

FemDesign.Results.ShellInternalForce.Ny
Ny'

FemDesign.Results.ShellInternalForce.Nxy
Nx'y'

FemDesign.Results.ShellInternalForce.Txz
Tx'z'

FemDesign.Results.ShellInternalForce.Tyz
Ty'z'

FemDesign.Results.ShellInternalForce.CaseIdentifier
Load case or combination name

FemDesign.Results.ShellInternalForce.DeconstructShellInternalForce(System.Collections.Generic.List{FemDesign.Results.ShellInternalForce},System.String)
The method has been created for returning the value for Grasshopper and Dynamo.
The method can still be use for C# users.